Documents/УстановкаЦенЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>УстановкаЦенЗанятий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РасценкиЗанятий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасценкиЗанятий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДлительностьЗанятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДлительностьЗанятий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обучающийся</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РасценкиЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>РасценкиЗанятий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДлительностьЗанятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДлительностьЗанятий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УстановкаЦенЗанятий/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.РасценкиЗанятий.Записывать = Истина;
	
	Для Каждого ТекСтрокаРасценкиЗанятий Из РасценкиЗанятий Цикл
		Движение = Движения.РасценкиЗанятий.Добавить();
		Движение.Период = Дата;
		Движение.Преподаватель = Преподаватель;
		Движение.ДлительностьЗанятия = ТекСтрокаРасценкиЗанятий.ДлительностьЗанятия;
		Движение.Обучающийся	= ТекСтрокаРасценкиЗанятий.Обучающийся;
		Движение.Цена = ТекСтрокаРасценкиЗанятий.Цена;
	КонецЦикла;
	
КонецПроцедуры
